In [1]:
import numpy as np 
import pandas as pd

In [2]:
grades = pd.Series(range(70, 100, 2))
grades

0     70
1     72
2     74
3     76
4     78
5     80
6     82
7     84
8     86
9     88
10    90
11    92
12    94
13    96
14    98
dtype: int64

In [3]:
grades.describe()

count    15.000000
mean     84.000000
std       8.944272
min      70.000000
25%      77.000000
50%      84.000000
75%      91.000000
max      98.000000
dtype: float64

In [4]:
height = pd.Series([160, 170, 180],
                  index=['Amy', 'Tom', 'Michael'])
height

Amy        160
Tom        170
Michael    180
dtype: int64

In [6]:
nations = pd.Series({'Korea': 82,
                     'USA': 1,
                     'China': 'cn'})
nations

Korea    82
USA       1
China    cn
dtype: object

## Pandas 자료형

| Pandas | Python | 
| ------ | ------ |
| object | string |
| int64  | int    |
| float64| float  |
| datetime| datetime|

In [7]:
scores = {'Amy': [92, 80, 70],
          'Tom': [56, 87, 100],
          'Michael': [96, 78, 88]}
scores_df = pd.DataFrame(scores)
scores_df

   Amy  Tom  Michael
0   92   56       96
1   80   87       78
2   70  100       88

In [8]:
scores = {'Amy': [92, 80, 70],
          'Tom': [56, 87, 100],
          'Michael': [96, 78]}
scores_df = pd.DataFrame(scores)
scores_df

ValueError: arrays must all be same length

In [9]:
scores_df

   Amy  Tom  Michael
0   92   56       96
1   80   87       78
2   70  100       88

In [10]:
scores_df.index

RangeIndex(start=0, stop=3, step=1)

In [11]:
type(scores_df.index)

pandas.core.indexes.range.RangeIndex

In [12]:
# DataFrame의 index setting
scores_df.index = ['Math', 'Science', 'Art']
scores_df

         Amy  Tom  Michael
Math      92   56       96
Science   80   87       78
Art       70  100       88

In [13]:
# DataFrame index 확인
scores_df.index

Index(['Math', 'Science', 'Art'], dtype='object')

In [14]:
# DataFrame column 확인
scores_df.columns

Index(['Amy', 'Tom', 'Michael'], dtype='object')

In [15]:
# DataFrame column 이름 바꾸기 
scores_df.columns = [1, 2, 3]
scores_df

          1    2   3
Math     92   56  96
Science  80   87  78
Art      70  100  88

In [17]:
scores_df = scores_df.rename(columns={1: 'Amy', 2: 'Tom', 3: 'Michael'})
scores_df

         Amy  Tom  Michael
Math      92   56       96
Science   80   87       78
Art       70  100       88

In [18]:
# DataFrame의 shape
scores_df.shape

(3, 3)

In [19]:
scores_df.columns = [x.lower() for x in scores_df.columns]
scores_df

         amy  tom  michael
Math      92   56       96
Science   80   87       78
Art       70  100       88

In [20]:
# DataFrame에서 각 column의 데이터 타입
scores_df.dtypes

amy        int64
tom        int64
michael    int64
dtype: object

In [21]:
scores_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, Math to Art
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   amy      3 non-null      int64
 1   tom      3 non-null      int64
 2   michael  3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [25]:
scores = {'Amy': [92, 80, 70],
          'Tom': [56, 87, 100],
          'Michael': [96, 78, 88]}
pd.DataFrame(scores, index=['Math', 'Science', 'Art'])

         Amy  Tom  Michael
Math      92   56       96
Science   80   87       78
Art       70  100       88

In [24]:
scores2 = [{'Amy': 92, 'Tom': 56, 'Michael': 96},
           {'Amy': 80, 'Tom': 87, 'Michael': 78},
           {'Amy': 70, 'Tom': 100, 'Michael': 88}]
pd.DataFrame(scores2, index=['Math', 'Science', 'Art'])

         Amy  Tom  Michael
Math      92   56       96
Science   80   87       78
Art       70  100       88

## DataFrame 내보내기, 불러오기

1. 내보내기
    * **excel** -> pd.to_excel
    * **csv** (comma-separated values) -> pd.to_csv
    * tsv (tab-separated values) -> pd.to_csv, delimiter='\t'
    
2. 불러오기
    * excel -> pd.read_excel
    * csv -> pd.read_csv
    * tsv -> pd.read_csv, delimiter='\t'

In [26]:
scores_df

         amy  tom  michael
Math      92   56       96
Science   80   87       78
Art       70  100       88

In [27]:
scores_df.to_excel('scores_df.xlsx')

In [31]:
scores_df = pd.read_excel('scores_df.xlsx', 
                          engine='openpyxl')
scores_df

  Unnamed: 0  amy  tom  michael
0       Math   92   56       96
1    Science   80   87       78
2        Art   70  100       88

In [56]:
scores_df = pd.read_excel('scores_df.xlsx', 
                          engine='openpyxl', 
                          index_col=0)
scores_df

         amy  tom  michael
Math      92   56       96
Science   80   87       78
Art       70  100       88

In [49]:
scores_df.index.name

In [32]:
scores_df.to_csv('scores_df.csv')

In [34]:
scores_df

  Unnamed: 0  amy  tom  michael
0       Math   92   56       96
1    Science   80   87       78
2        Art   70  100       88

In [44]:
scores_df2 = pd.read_csv('scores_df.csv', 
                         usecols=[1,2,3,4], 
                         index_col=0)
scores_df2

              amy  tom  michael
Unnamed: 0.1
Math           92   56       96
Science        80   87       78
Art            70  100       88

In [45]:
scores_df2.index

Index(['Math', 'Science', 'Art'], dtype='object', name='Unnamed: 0.1')

In [50]:
scores_df2.index.name = None
scores_df2

         amy  tom  michael
Math      92   56       96
Science   80   87       78
Art       70  100       88

In [57]:
scores_df['test'] = [
    [1, 2, 3],
    [4, 5, 6],
    [7, 8, 9]  ]
scores_df

         amy  tom  michael       test
Math      92   56       96  [1, 2, 3]
Science   80   87       78  [4, 5, 6]
Art       70  100       88  [7, 8, 9]

In [52]:
scores_df.to_excel('scores_df_list.xlsx')

In [53]:
scores_df = pd.read_excel('scores_df_list.xlsx', 
                          index_col=0,
                          engine='openpyxl')
scores_df

         amy  tom  michael       test
Math      92   56       96  [1, 2, 3]
Science   80   87       78  [4, 5, 6]
Art       70  100       88  [7, 8, 9]

In [55]:
scores_df['test']['Math']

'[1, 2, 3]'

In [58]:
import pickle as pkl

## pickle

* 데이터프레임 컬럼에 만약에 python object가 들어가 있다고 칩시다 (list, set, dict, tuple) 
* 그러면 이 상태에서 바로 excel, csv 포맷으로 저장하면 다시 불러왔을 때 python object (list, set, dict, tuple)가 문자열 처리 됩니다 
* 아예 리스트로, 튜플로, 딕셔너리로, 집합으로 저장하고 불러올 수 있으면 편하겠죠? 
* 파이썬 built-in library 중에서 pickle 이라는 라이브러리가 이런 작업을 해줄 수 있습니다 
* 다만, pickle은 판다스에 들어가 있는 함수같은게 아니고 다른 라이브러리이므로 pickle의 함수를 사용해서 저장하고 불러와 주면 됩니다
    * pkl.load: 피클링 되어 있는 파일 불러오기
    * pkl.dump: 파일 피클링하기
    
* pickle은 뭐가 되었던 파이썬 객체는 다 저장하고, 불러올 수 있어요
    * list, tuple, set, dict, numpy array, pandas dataframe, pandas series 등등 
* 근데 문제는 pickle은 파이썬 라이브러리잖아용 -> 파이썬 내부에서 열어볼 수 있어요

In [59]:
scores_df

         amy  tom  michael       test
Math      92   56       96  [1, 2, 3]
Science   80   87       78  [4, 5, 6]
Art       70  100       88  [7, 8, 9]

In [60]:
scores_df['test']['Math']

[1, 2, 3]

In [61]:
type(scores_df['test']['Math'])

list

In [62]:
# pkl로 저장: pkl.dump
pkl.dump(scores_df, open('scores_df.pkl', 'wb'))

In [63]:
# pkl로 불러오기: pkl.load
scores_df = pkl.load(open('scores_df.pkl', 'rb'))
scores_df

         amy  tom  michael       test
Math      92   56       96  [1, 2, 3]
Science   80   87       78  [4, 5, 6]
Art       70  100       88  [7, 8, 9]

In [64]:
scores_df['test']['Math']

[1, 2, 3]

In [65]:
type(scores_df['test']['Math'])

list

In [66]:
scores_df.values

array([[92, 56, 96, list([1, 2, 3])],
       [80, 87, 78, list([4, 5, 6])],
       [70, 100, 88, list([7, 8, 9])]], dtype=object)

In [67]:
type(scores_df.values)

numpy.ndarray

In [70]:
scores_df.describe()

             amy         tom    michael
count   3.000000    3.000000   3.000000
mean   80.666667   81.000000  87.333333
std    11.015141   22.605309   9.018500
min    70.000000   56.000000  78.000000
25%    75.000000   71.500000  83.000000
50%    80.000000   87.000000  88.000000
75%    86.000000   93.500000  92.000000
max    92.000000  100.000000  96.000000

In [73]:
df = pd.DataFrame(np.random.randn(6, 4))
# df.columns = ['A', 'B', 'C', 'D']
df.columns = list('ABCD')
df.index = pd.date_range('20220428', periods=6)
df

                   A         B         C         D
2022-04-28  1.078411  0.413953  1.387156  0.511618
2022-04-29  0.584475  1.449160 -0.044823 -0.371938
2022-04-30  0.288503 -0.175398  1.467656 -0.062908
2022-05-01 -0.891399  1.949047 -0.484660  0.561778
2022-05-02 -0.326830 -0.015493 -0.939429 -0.046389
2022-05-03  1.910952  0.724352 -1.639381 -0.273253

In [74]:
help(pd.date_range)

Help on function date_range in module pandas.core.indexes.datetimes:

date_range(start=None, end=None, periods=None, freq=None, tz=None, normalize=False, name=None, closed=None, **kwargs) -> pandas.core.indexes.datetimes.DatetimeIndex
    Return a fixed frequency DatetimeIndex.

    Parameters
    ----------
    start : str or datetime-like, optional
        Left bound for generating dates.
    end : str or datetime-like, optional
        Right bound for generating dates.
    periods : int, optional
        Number of periods to generate.
    freq : str or DateOffset, default 'D'
        Frequency strings can have multiples, e.g. '5H'. See
        :ref:`here <timeseries.offset_aliases>` for a list of
        frequency aliases.
    tz : str or tzinfo, optional
        Time zone name for returning localized DatetimeIndex, for example
        'Asia/Hong_Kong'. By default, the resulting DatetimeIndex is
        timezone-naive.
    normalize : bool, default False
        Normalize start/end dates to midnight before generating date range.
    name : str, default None
        Name of the resulting DatetimeIndex.
    closed : {None, 'left', 'right'}, optional
        Make the interval closed with respect to the given frequency to
        the 'left', 'right', or both sides (None, the default).
    **kwargs
        For compatibility. Has no effect on the result.

    Returns
    -------
    rng : DatetimeIndex

    See Also
    --------
    DatetimeIndex : An immutable container for datetimes.
    timedelta_range : Return a fixed frequency TimedeltaIndex.
    period_range : Return a fixed frequency PeriodIndex.
    interval_range : Return a fixed frequency IntervalIndex.

    Notes
    -----
    Of the four parameters ``start``, ``end``, ``periods``, and ``freq``,
    exactly three must be specified. If ``freq`` is omitted, the resulting
    ``DatetimeIndex`` will have ``periods`` linearly spaced elements between
    ``start`` and ``end`` (closed on both sides).

    To learn more about the frequency strings, please see `this link
    <https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#offset-aliases>`__.

    Examples
    --------
    **Specifying the values**

    The next four examples generate the same `DatetimeIndex`, but vary
    the combination of `start`, `end` and `periods`.

    Specify `start` and `end`, with the default daily frequency.

    >>> pd.date_range(start='1/1/2018', end='1/08/2018')
    DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
                   '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08'],
                  dtype='datetime64[ns]', freq='D')

    Specify `start` and `periods`, the number of periods (days).

    >>> pd.date_range(start='1/1/2018', periods=8)
    DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04',
                   '2018-01-05', '2018-01-06', '2018-01-07', '2018-01-08'],
                  dtype='datetime64[ns]', freq='D')

    Specify `end` and `periods`, the number of periods (days).

    >>> pd.date_range(end='1/1/2018', periods=8)
    DatetimeIndex(['2017-12-25', '2017-12-26', '2017-12-27', '2017-12-28',
                   '2017-12-29', '2017-12-30', '2017-12-31', '2018-01-01'],
                  dtype='datetime64[ns]', freq='D')

    Specify `start`, `end`, and `periods`; the frequency is generated
    automatically (linearly spaced).

    >>> pd.date_range(start='2018-04-24', end='2018-04-27', periods=3)
    DatetimeIndex(['2018-04-24 00:00:00', '2018-04-25 12:00:00',
                   '2018-04-27 00:00:00'],
                  dtype='datetime64[ns]', freq=None)

    **Other Parameters**

    Changed the `freq` (frequency) to ``'M'`` (month end frequency).

    >>> pd.date_range(start='1/1/2018', periods=5, freq='M')
    DatetimeIndex(['2018-01-31', '2018-02-28', '2018-03-31', '2018-04-30',
                   '2018-05-31'],
                  dtype='datetime64[ns]', freq='M')

    Multiples are allowed

    >>> pd.date_range(start='1/1/2018', periods=5, freq='3M')
    DatetimeIndex(['2018-01-31', '2018-04-30', '2018-07-31', '2018-10-31',
                   '2019-01-31'],
                  dtype='datetime64[ns]', freq='3M')

    `freq` can also be specified as an Offset object.

    >>> pd.date_range(start='1/1/2018', periods=5, freq=pd.offsets.MonthEnd(3))
    DatetimeIndex(['2018-01-31', '2018-04-30', '2018-07-31', '2018-10-31',
                   '2019-01-31'],
                  dtype='datetime64[ns]', freq='3M')

    Specify `tz` to set the timezone.

    >>> pd.date_range(start='1/1/2018', periods=5, tz='Asia/Tokyo')
    DatetimeIndex(['2018-01-01 00:00:00+09:00', '2018-01-02 00:00:00+09:00',
                   '2018-01-03 00:00:00+09:00', '2018-01-04 00:00:00+09:00',
                   '2018-01-05 00:00:00+09:00'],
                  dtype='datetime64[ns, Asia/Tokyo]', freq='D')

    `closed` controls whether to include `start` and `end` that are on the
    boundary. The default includes boundary points on either end.

    >>> pd.date_range(start='2017-01-01', end='2017-01-04', closed=None)
    DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03', '2017-01-04'],
                  dtype='datetime64[ns]', freq='D')

    Use ``closed='left'`` to exclude `end` if it falls on the boundary.

    >>> pd.date_range(start='2017-01-01', end='2017-01-04', closed='left')
    DatetimeIndex(['2017-01-01', '2017-01-02', '2017-01-03'],
                  dtype='datetime64[ns]', freq='D')

    Use ``closed='right'`` to exclude `start` if it falls on the boundary.

    >>> pd.date_range(start='2017-01-01', end='2017-01-04', closed='right')
    DatetimeIndex(['2017-01-02', '2017-01-03', '2017-01-04'],
                  dtype='datetime64[ns]', freq='D')

In [75]:
df.index

DatetimeIndex(['2022-04-28', '2022-04-29', '2022-04-30', '2022-05-01',
               '2022-05-02', '2022-05-03'],
              dtype='datetime64[ns]', freq='D')

In [78]:
df.index[0]

Timestamp('2022-04-28 00:00:00', freq='D')

In [79]:
type(df.index[0])

pandas._libs.tslibs.timestamps.Timestamp

In [76]:
import datetime

In [77]:
datetime.datetime(2022, 4, 28)

datetime.datetime(2022, 4, 28, 0, 0)

In [80]:
df.index[0] == datetime.datetime(2022, 4, 28)

True

In [81]:
pd.__version__

'1.1.5'

In [84]:
# dataframe 맨 첫 5개(아니면 넣은 숫자)의 row 프린트
df.head(3)

                   A         B         C         D
2022-04-28  1.078411  0.413953  1.387156  0.511618
2022-04-29  0.584475  1.449160 -0.044823 -0.371938
2022-04-30  0.288503 -0.175398  1.467656 -0.062908

In [86]:
# dataframe 끝에서 5개(아니면 넣은 숫자)의 row 프린트
df.tail()

                   A         B         C         D
2022-04-29  0.584475  1.449160 -0.044823 -0.371938
2022-04-30  0.288503 -0.175398  1.467656 -0.062908
2022-05-01 -0.891399  1.949047 -0.484660  0.561778
2022-05-02 -0.326830 -0.015493 -0.939429 -0.046389
2022-05-03  1.910952  0.724352 -1.639381 -0.273253

In [87]:
df['A']

2022-04-28    1.078411
2022-04-29    0.584475
2022-04-30    0.288503
2022-05-01   -0.891399
2022-05-02   -0.326830
2022-05-03    1.910952
Freq: D, Name: A, dtype: float64

In [88]:
df.A

2022-04-28    1.078411
2022-04-29    0.584475
2022-04-30    0.288503
2022-05-01   -0.891399
2022-05-02   -0.326830
2022-05-03    1.910952
Freq: D, Name: A, dtype: float64

In [90]:
# 새로운 컬럼을 만들 때에는 attribute처럼 쓰면 저장 안됩니당
df['E'] = [1, 2, 3, 4, 5, 6]
df

                   A         B         C         D  E
2022-04-28  1.078411  0.413953  1.387156  0.511618  1
2022-04-29  0.584475  1.449160 -0.044823 -0.371938  2
2022-04-30  0.288503 -0.175398  1.467656 -0.062908  3
2022-05-01 -0.891399  1.949047 -0.484660  0.561778  4
2022-05-02 -0.326830 -0.015493 -0.939429 -0.046389  5
2022-05-03  1.910952  0.724352 -1.639381 -0.273253  6

In [91]:
# 이미 있는 컬럼의 값을 바꿀 때에는 attribute처럼 써도 상관 없어요
df.D = list('abcdef')
df

                   A         B         C  D  E
2022-04-28  1.078411  0.413953  1.387156  a  1
2022-04-29  0.584475  1.449160 -0.044823  b  2
2022-04-30  0.288503 -0.175398  1.467656  c  3
2022-05-01 -0.891399  1.949047 -0.484660  d  4
2022-05-02 -0.326830 -0.015493 -0.939429  e  5
2022-05-03  1.910952  0.724352 -1.639381  f  6

In [92]:
# column 여러개 선택할 때에는 리스트로 컬럼 이름을 묶어서 불러오면 됩니다
df[ ['A', 'B'] ]

                   A         B
2022-04-28  1.078411  0.413953
2022-04-29  0.584475  1.449160
2022-04-30  0.288503 -0.175398
2022-05-01 -0.891399  1.949047
2022-05-02 -0.326830 -0.015493
2022-05-03  1.910952  0.724352

In [93]:
df['A']

2022-04-28    1.078411
2022-04-29    0.584475
2022-04-30    0.288503
2022-05-01   -0.891399
2022-05-02   -0.326830
2022-05-03    1.910952
Freq: D, Name: A, dtype: float64

In [94]:
type(df['A'])

pandas.core.series.Series

In [95]:
type(df[['A', 'B']])

pandas.core.frame.DataFrame

In [102]:
df['F'] = [1.1, 2.1, 3.1, 4.1, 5.1, 6.1]
df

                   A         B         C  D  E    F
2022-04-28  1.078411  0.413953  1.387156  a  1  1.1
2022-04-29  0.584475  1.449160 -0.044823  b  2  2.1
2022-04-30  0.288503 -0.175398  1.467656  c  3  3.1
2022-05-01 -0.891399  1.949047 -0.484660  d  4  4.1
2022-05-02 -0.326830 -0.015493 -0.939429  e  5  5.1
2022-05-03  1.910952  0.724352 -1.639381  f  6  6.1

In [104]:
data = pd.Series([-1.2, -1.5, -1.7],
                 index=pd.date_range('2022-04-29', periods=3))
df['F'] = data
df

                   A         B         C  D  E    F
2022-04-28  1.078411  0.413953  1.387156  a  1  NaN
2022-04-29  0.584475  1.449160 -0.044823  b  2 -1.2
2022-04-30  0.288503 -0.175398  1.467656  c  3 -1.5
2022-05-01 -0.891399  1.949047 -0.484660  d  4 -1.7
2022-05-02 -0.326830 -0.015493 -0.939429  e  5  NaN
2022-05-03  1.910952  0.724352 -1.639381  f  6  NaN

In [105]:
data

2022-04-29   -1.2
2022-04-30   -1.5
2022-05-01   -1.7
Freq: D, dtype: float64

In [106]:
df['G'] = df['A'] + df['B']
df

                   A         B         C  D  E    F         G
2022-04-28  1.078411  0.413953  1.387156  a  1  NaN  1.492364
2022-04-29  0.584475  1.449160 -0.044823  b  2 -1.2  2.033634
2022-04-30  0.288503 -0.175398  1.467656  c  3 -1.5  0.113105
2022-05-01 -0.891399  1.949047 -0.484660  d  4 -1.7  1.057648
2022-05-02 -0.326830 -0.015493 -0.939429  e  5  NaN -0.342322
2022-05-03  1.910952  0.724352 -1.639381  f  6  NaN  2.635305

In [107]:
df['H'] = df['G'] > 0
df

                   A         B         C  D  E    F         G      H
2022-04-28  1.078411  0.413953  1.387156  a  1  NaN  1.492364   True
2022-04-29  0.584475  1.449160 -0.044823  b  2 -1.2  2.033634   True
2022-04-30  0.288503 -0.175398  1.467656  c  3 -1.5  0.113105   True
2022-05-01 -0.891399  1.949047 -0.484660  d  4 -1.7  1.057648   True
2022-05-02 -0.326830 -0.015493 -0.939429  e  5  NaN -0.342322  False
2022-05-03  1.910952  0.724352 -1.639381  f  6  NaN  2.635305   True

In [108]:
df['H'] = (df['G'] > 0) & (df['C'] < 0)
df

                   A         B         C  D  E    F         G      H
2022-04-28  1.078411  0.413953  1.387156  a  1  NaN  1.492364  False
2022-04-29  0.584475  1.449160 -0.044823  b  2 -1.2  2.033634   True
2022-04-30  0.288503 -0.175398  1.467656  c  3 -1.5  0.113105  False
2022-05-01 -0.891399  1.949047 -0.484660  d  4 -1.7  1.057648   True
2022-05-02 -0.326830 -0.015493 -0.939429  e  5  NaN -0.342322  False
2022-05-03  1.910952  0.724352 -1.639381  f  6  NaN  2.635305   True

In [109]:
del df['E']

In [110]:
df

                   A         B         C  D    F         G      H
2022-04-28  1.078411  0.413953  1.387156  a  NaN  1.492364  False
2022-04-29  0.584475  1.449160 -0.044823  b -1.2  2.033634   True
2022-04-30  0.288503 -0.175398  1.467656  c -1.5  0.113105  False
2022-05-01 -0.891399  1.949047 -0.484660  d -1.7  1.057648   True
2022-05-02 -0.326830 -0.015493 -0.939429  e  NaN -0.342322  False
2022-05-03  1.910952  0.724352 -1.639381  f  NaN  2.635305   True

In [111]:
# dataframe 행 가져오기
df[0:3]

                   A         B         C  D    F         G      H
2022-04-28  1.078411  0.413953  1.387156  a  NaN  1.492364  False
2022-04-29  0.584475  1.449160 -0.044823  b -1.2  2.033634   True
2022-04-30  0.288503 -0.175398  1.467656  c -1.5  0.113105  False

In [112]:
df.loc['2022-04-28']

A     1.07841
B    0.413953
C     1.38716
D           a
F         NaN
G     1.49236
H       False
Name: 2022-04-28 00:00:00, dtype: object

In [113]:
type(df.loc['2022-04-28'])

pandas.core.series.Series

In [114]:
df.loc['2022-04-28':'2022-05-01']

                   A         B         C  D    F         G      H
2022-04-28  1.078411  0.413953  1.387156  a  NaN  1.492364  False
2022-04-29  0.584475  1.449160 -0.044823  b -1.2  2.033634   True
2022-04-30  0.288503 -0.175398  1.467656  c -1.5  0.113105  False
2022-05-01 -0.891399  1.949047 -0.484660  d -1.7  1.057648   True

In [115]:
df.loc['2022-04-28':'2022-05-01', 'A']

2022-04-28    1.078411
2022-04-29    0.584475
2022-04-30    0.288503
2022-05-01   -0.891399
Freq: D, Name: A, dtype: float64

In [116]:
df.loc['2022-04-28':'2022-05-01', 'A':'D']

                   A         B         C  D
2022-04-28  1.078411  0.413953  1.387156  a
2022-04-29  0.584475  1.449160 -0.044823  b
2022-04-30  0.288503 -0.175398  1.467656  c
2022-05-01 -0.891399  1.949047 -0.484660  d

In [117]:
# 범위 말고 특정 컬럼만
df.loc['2022-04-28':'2022-05-01', ['A', 'C']]

                   A         C
2022-04-28  1.078411  1.387156
2022-04-29  0.584475 -0.044823
2022-04-30  0.288503  1.467656
2022-05-01 -0.891399 -0.484660

In [118]:
# 특정 row와 특정 column만
df.loc[['2022-04-28','2022-05-01'], ['A', 'C']]

                   A         C
2022-04-28  1.078411  1.387156
2022-05-01 -0.891399 -0.484660